package day03.ex;


	/*
	  문제 4 ]
	  		1년은 365.2426 일이다.
	  		이것은 과연 며칠 몇시간 몇분 몇초인지 계산하고 출력하세요.
	  		
	  		힌트 ]
	  			365.2426일은 단위가 일 단위다.
	  			하루는 24시간이다.
	  			따라서 0.5일은 12시간을 의미한다.
	  			
	 */


// 정수로 먼저 만들기
// 365.2426에서 소수점 뒤의 2426에 24(시간)을 곱하면 시간이 나옴.
// 0.2426 * 24 => 시간 * 60 => 분 * 60 => 초단위로 변환이 됨
public class Ex04 {
	public static void main(String[] args) {
/*
		//할 일
		// 1. 데이터 변수에 기억
		double tmp = total;		
		//2. 누적계산될 변수 만들고
		int day = (int) tmp;
		tmp = tmp - day;	// tmp -= day;
		//3. 날수 구하고->누적 변수에 계산해서 업데이트
		int tsec = (int) 0.2426 * 24 * 60 * 60;

		//4. 시간 구하고->->누적 변수에 계산해서 업데이트
		

		//5. 분 구하고->누적 변수에 계산해서 업데이트
		
		//6. 초 구하고 ->누적 변수에 계산해서 업데이트
		
		//7, 출력
		
		*/
		
		
		
/* ㄴㅐ가 하려던 수식 ^^,,,,,,,,,,,		
		
		
		
		double days = 365.2426;
		//days = 1년
		
		double tmp = days;
		
		double day = tmp / 1.0;
		//day 지정 후
		tmp = tmp % 1.0;
		//1년을 일단위로 먼저 나누고,,,?
		
		double dd = tmp / 0.5;
		tmp = tmp % 0.5;
		//12시간
		
		double 
		
		*/
		
	}

}
